In [1]:
import pandas as pd
from pathlib import Path

In [2]:
#load File
school_data_to_load = Path("schools_complete.csv")
student_data_to_load = Path("students_complete.csv")

In [3]:
#Read File
school_data_df = pd.read_csv(school_data_to_load)
student_data_df = pd.read_csv(student_data_to_load)

In [4]:
#Review read school file
school_data_df.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [5]:
#Review student read file
student_data_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [6]:
# Combine the data into a single dataset  
school_data_complete_df = pd.merge(student_data_df, school_data_df, how="left", on=["school_name", "school_name"])

In [7]:
#School and Student data combined
school_data_complete_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [8]:
#Unique School name count
unique_school_name_df = school_data_complete_df["school_name"].nunique()
unique_school_name_df

15

In [9]:
#Convert school count to integer
schools = pd.DataFrame(data=['15'],columns=['Total Schools'])
schools['Total Schools'] = schools['Total Schools'].astype(int)
schools

   Total Schools
0             15

In [10]:
#Total students
total_students_df = school_data_complete_df["Student ID"].nunique()
total_students_df

39170

In [11]:
#Convert total student count to integer
students = pd.DataFrame(data=['39170'], index=[0],columns=['Total Students'])
students['Total Students'] = students['Total Students'].astype(int)
students

   Total Students
0           39170

In [12]:
#Total Budget
total_budget_df = school_data_df["budget"].sum()
total_budget_df

24649428

In [13]:
#Convert total budget to integer
budget = pd.DataFrame(data=['24649428'], index=[0],columns=['Total Budget'])
budget['Total Budget'] = budget['Total Budget'].astype(int)
budget

   Total Budget
0      24649428

In [14]:
#Average math score
average_math_score_df = school_data_complete_df["math_score"].mean()
average_math_score_df

78.98537145774827

In [15]:
#Convert average math score to integer
average_math_score = pd.DataFrame(data=['78.985732'], index=[0],columns=['Average Math Score'])
average_math_score

  Average Math Score
0          78.985732

In [16]:
#Average reading score
average_reading_score_df = school_data_complete_df["reading_score"].mean()
average_reading_score_df

81.87784018381414

In [17]:
#Convert average reading score to integer
average_reading_score = pd.DataFrame(data=['81.87784'], index=[0],columns=['Average Reading Score'])
average_reading_score

  Average Reading Score
0              81.87784

In [18]:
#Students passing math  
passing_math_count_df = school_data_complete_df[(school_data_complete_df["math_score"] >=70)].count()["student_name"]
passing_math_count_df

29370

In [19]:
#Students passing math %
passing_math_percent_df = passing_math_count_df / (students) * 100
percent_passing_math = pd.DataFrame(data=['74.980853'], index=[0],columns=['% Passing Math'])
percent_passing_math

  % Passing Math
0      74.980853

In [20]:
#Students passing reading 
passing_read_count_df = school_data_complete_df[(school_data_complete_df["reading_score"] >=70)].count()["student_name"]
passing_read_count_df

33610

In [21]:
#Students passing reading %
passing_read_percent_df = passing_read_count_df / (students) * 100
percent_passing_reading = pd.DataFrame(data=['85.805463'], index=[0],columns=['% Passing Reading'])
percent_passing_reading

  % Passing Reading
0         85.805463

In [22]:
#% of students that passed math and reading and change to integer
passing_math_reading_count = school_data_complete_df[
    (school_data_complete_df["math_score"] >= 70) & (school_data_complete_df["reading_score"] >= 70)
].count()["student_name"]
overall_passing_rate = passing_math_reading_count / (students) * 100
overall_passing_rate = pd.DataFrame(data=['65.172326'], index=[0],columns=['Overall Passing Rate'])
overall_passing_rate

  Overall Passing Rate
0            65.172326

In [40]:
#Create district summary
district_summary_info = pd.concat([schools, students, budget, average_math_score, average_reading_score, percent_passing_math, percent_passing_reading,overall_passing_rate], axis=1)
district_summary_info["Total Students"] = district_summary_info["Total Students"].map("{:,}".format)
district_summary_info["Total Budget"] = district_summary_info["Total Budget"].map("${:,.2f}".format)
district_summary_info

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,Overall Passing Rate
0,15,"39,170","$24,649,428.00",78.985732,81.87784,74.980853,85.805463,65.172326

In [24]:
#find school types
school_types = school_data_complete_df["type"].unique()
school_types

array(['District', 'Charter'], dtype=object)

In [25]:
#Total students per school
school_enrollees = school_data_complete_df["school_name"]
Info_school_enrollees = pd.DataFrame(school_enrollees)
per_school_enrollees = Info_school_enrollees.groupby("school_name").size().reset_index(name="count")
per_school_enrollees

              school_name  count
0      Bailey High School   4976
1     Cabrera High School   1858
2    Figueroa High School   2949
3        Ford High School   2739
4     Griffin High School   1468
5   Hernandez High School   4635
6      Holden High School    427
7       Huang High School   2917
8     Johnson High School   4761
9        Pena High School    962
10  Rodriguez High School   3999
11    Shelton High School   1761
12     Thomas High School   1635
13     Wilson High School   2283
14     Wright High School   1800

In [26]:
#Each School Budget
school_money_df = school_data_complete_df
budget_break_down = pd.DataFrame(school_money_df)
per_school_budget = budget_break_down[["school_name","budget"]].groupby("school_name")["budget"].sum().reset_index(name="School Budget")
per_school_budget

              school_name  School Budget
0      Bailey High School    15549641728
1     Cabrera High School     2009159448
2    Figueroa High School     5557128039
3        Ford High School     4831365924
4     Griffin High School     1346890000
5   Hernandez High School    14007062700
6      Holden High School      105933149
7       Huang High School     5573322295
8     Johnson High School    14733628650
9        Pena High School      563595396
10  Rodriguez High School    10186904637
11    Shelton High School     1860672600
12     Thomas High School     1705517550
13     Wilson High School     3012587442
14     Wright High School     1888920000

In [27]:
#Per school capita
per_capita = pd.DataFrame(per_school_budget)
per_student_info = pd.DataFrame(per_school_enrollees)
per_capita_per_school = pd.merge(per_capita, per_student_info,on="school_name", how="outer")
per_capita_per_school['Per Capita'] = per_capita_per_school['School Budget'] / per_capita_per_school['count']
per_capita_per_school

              school_name  School Budget  count  Per Capita
0      Bailey High School    15549641728   4976   3124928.0
1     Cabrera High School     2009159448   1858   1081356.0
2    Figueroa High School     5557128039   2949   1884411.0
3        Ford High School     4831365924   2739   1763916.0
4     Griffin High School     1346890000   1468    917500.0
5   Hernandez High School    14007062700   4635   3022020.0
6      Holden High School      105933149    427    248087.0
7       Huang High School     5573322295   2917   1910635.0
8     Johnson High School    14733628650   4761   3094650.0
9        Pena High School      563595396    962    585858.0
10  Rodriguez High School    10186904637   3999   2547363.0
11    Shelton High School     1860672600   1761   1056600.0
12     Thomas High School     1705517550   1635   1043130.0
13     Wilson High School     3012587442   2283   1319574.0
14     Wright High School     1888920000   1800   1049400.0

In [28]:
#Average test scores per school
per_school_info_df = school_data_complete_df
math_and_reading_per_school = pd.DataFrame(per_school_info_df)
per_school_scores = math_and_reading_per_school[["school_name","reading_score","math_score"]].groupby("school_name").agg({"reading_score": "mean", "math_score": "mean"}).reset_index()
per_school_scores

              school_name  reading_score  math_score
0      Bailey High School      81.033963   77.048432
1     Cabrera High School      83.975780   83.061895
2    Figueroa High School      81.158020   76.711767
3        Ford High School      80.746258   77.102592
4     Griffin High School      83.816757   83.351499
5   Hernandez High School      80.934412   77.289752
6      Holden High School      83.814988   83.803279
7       Huang High School      81.182722   76.629414
8     Johnson High School      80.966394   77.072464
9        Pena High School      84.044699   83.839917
10  Rodriguez High School      80.744686   76.842711
11    Shelton High School      83.725724   83.359455
12     Thomas High School      83.848930   83.418349
13     Wilson High School      83.989488   83.274201
14     Wright High School      83.955000   83.682222

In [29]:
# Calculate the number of students with math scores of 70 or higher
math_students_above_70 = school_data_complete_df[(school_data_complete_df["math_score"] >=70)]
math_students_above_70

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635
8,8,Michael Roth,M,10th,Huang High School,95,87,0,District,2917,1910635
...,...,...,...,...,...,...,...,...,...,...,...
39165,39165,Donna Howard,F,12th,Thomas High School,99,90,14,Charter,1635,1043130
39166,39166,Dawn Bell,F,10th,Thomas High School,95,70,14,Charter,1635,1043130
39167,39167,Rebecca Tanner,F,9th,Thomas High School,73,84,14,Charter,1635,1043130
39168,39168,Desiree Kidd,F,10th,Thomas High School,99,90,14,Charter,1635,1043130
39169,39169,Carolyn Jackson,F,11th,Thomas High School,95,75,14,Charter,1635,1043130

In [30]:
# Calculate the number of students per school with math scores of 70 or higher
students_above_70 = school_data_complete_df[(school_data_complete_df["math_score"] >=70)]
per_school_math_above_70 = students_above_70.groupby(["school_name"]).size()
per_school_math_above_70

school_name
Bailey High School       3318
Cabrera High School      1749
Figueroa High School     1946
Ford High School         1871
Griffin High School      1371
Hernandez High School    3094
Holden High School        395
Huang High School        1916
Johnson High School      3145
Pena High School          910
Rodriguez High School    2654
Shelton High School      1653
Thomas High School       1525
Wilson High School       2143
Wright High School       1680
dtype: int64

In [31]:
# Calculate the number of student with reading scores of 70 or higher
read_students_above_70 = school_data_complete_df[(school_data_complete_df["reading_score"] >=70)]
read_students_above_70

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635
...,...,...,...,...,...,...,...,...,...,...,...
39165,39165,Donna Howard,F,12th,Thomas High School,99,90,14,Charter,1635,1043130
39166,39166,Dawn Bell,F,10th,Thomas High School,95,70,14,Charter,1635,1043130
39167,39167,Rebecca Tanner,F,9th,Thomas High School,73,84,14,Charter,1635,1043130
39168,39168,Desiree Kidd,F,10th,Thomas High School,99,90,14,Charter,1635,1043130
39169,39169,Carolyn Jackson,F,11th,Thomas High School,95,75,14,Charter,1635,1043130

In [32]:
# Calculate the number of students per school with reading scores of 70 or higher
per_school_read_above_70 = read_students_above_70.groupby(["school_name"]).size()
per_school_read_above_70

school_name
Bailey High School       4077
Cabrera High School      1803
Figueroa High School     2381
Ford High School         2172
Griffin High School      1426
Hernandez High School    3748
Holden High School        411
Huang High School        2372
Johnson High School      3867
Pena High School          923
Rodriguez High School    3208
Shelton High School      1688
Thomas High School       1591
Wilson High School       2204
Wright High School       1739
dtype: int64

In [33]:
per_school_math_above_70['count'] = per_school_enrollees['count'].astype(int)
above_70_per_school = per_school_math_above_70
above_70_per_school

school_name
Bailey High School                                                    3318
Cabrera High School                                                   1749
Figueroa High School                                                  1946
Ford High School                                                      1871
Griffin High School                                                   1371
Hernandez High School                                                 3094
Holden High School                                                     395
Huang High School                                                     1916
Johnson High School                                                   3145
Pena High School                                                       910
Rodriguez High School                                                 2654
Shelton High School                                                   1653
Thomas High School                                                    1525
Wilson High School                                                    2143
Wright High School                                                    1680
count                    0     4976
1     1858
2     2949
3     2739
4 ...
dtype: object

In [34]:
# Use the provided code to calculate the number of students per school that passed both math and reading with scores of 70 or higher
students_passing_math_and_reading = school_data_complete_df[(school_data_complete_df["reading_score"] >= 70) & (school_data_complete_df["math_score"] >= 70)]
school_students_passing_math_and_reading = students_passing_math_and_reading.groupby(["school_name"]).size()
school_students_passing_math_and_reading

school_name
Bailey High School       2719
Cabrera High School      1697
Figueroa High School     1569
Ford High School         1487
Griffin High School      1330
Hernandez High School    2481
Holden High School        381
Huang High School        1561
Johnson High School      2549
Pena High School          871
Rodriguez High School    2119
Shelton High School      1583
Thomas High School       1487
Wilson High School       2068
Wright High School       1626
dtype: int64

In [35]:
# Use the provided code to calculate the passing rates
per_school_passing_math = above_70_per_school / per_school_enrollees * 100
per_school_passing_reading = per_school_read_above_70 / per_school_enrollees * 100
overall_passing_rate = school_students_passing_math_and_reading / per_school_enrollees * 100
overall_passing_rate

,Bailey High School,Cabrera High School,Figueroa High School,Ford High School,Griffin High School,Hernandez High School,Holden High School,Huang High School,Johnson High School,Pena High School,Rodriguez High School,Shelton High School,Thomas High School,Wilson High School,Wright High School,count,school_name
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
9,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
10,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
11,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
12,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
13,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
14,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [36]:
# Create a DataFrame called `per_school_summary` with columns for the calculations above.
per_school_summary = school_types, students, budget, average_math_score, average_reading_score, percent_passing_math, percent_passing_reading


# Display the DataFrame
per_school_summary

(array(['District', 'Charter'], dtype=object),
    Total Students
 0           39170,
    Total Budget
 0      24649428,
   Average Math Score
 0          78.985732,
   Average Reading Score
 0              81.87784,
   % Passing Math
 0      74.980853,
   % Passing Reading
 0         85.805463)

In [37]:
# Sort the schools by `% Overall Passing` in descending order and display the top 5 rows.
overall_passing_rate = passing_math_reading_count / (students) * 100
overall_passing_rate = pd.DataFrame(data=['65.172326'], index=[0],columns=['Overall Passing Rate'])
overall_passing_rate

  Overall Passing Rate
0            65.172326

In [38]:
per_school_passing_math = school_students_passing_math / per_school_counts * 100
per_school_passing_reading = school_students_passing_reading / per_school_counts * 100
overall_passing_rate = school_students_passing_math_and_reading / per_school_counts * 100

NameError: name 'school_students_passing_math' is not defined